<div class="header p-3 m-2">
    <h2>Принцип разделения интерфейса (Interface segregation)</h2>
</div>
<div class="content shadow-lg p-5 m-2 bg-white rounded">
    <p>
        Этот принцип направлен на устранение недостатков, связанных с реализацией больших интерфейсов.
    </p>
    <p class="alert alert-primary">
        Данный принцип гласит, что «Много специализированных интерфейсов лучше, чем один универсальный»
    </p>
    <p>
        Соблюдение этого принципа необходимо для того, чтобы классы-клиенты использующий/реализующий интерфейс знали
        только
        о тех методах, которые они используют, что ведёт к уменьшению количества неиспользуемого кода
    </p>
    <p>Источники&raquo;
        <a class="btn btn-secondary" target="_blank" href="https://habr.com/ru/post/208442/" role="button">
            Habr
        </a>
        Рассмотрим пример:
    </p>
    <pre>
    <code class="php">
<?= $content; ?>
    </code>
</pre>
</div>