<h2>Принцип подстановки Барбары Лисков (Liskov substitution)</h2>
<p>Объекты в программе могут быть заменены их наследниками без изменения свойств программы». Своими словами я бы это
    сказал так <br>
    1. при использовании наследника класса результат выполнения кода должен быть предсказуем и не изменять
    свойств метод. <br>
    2 .Поведение наследуемых классов не должно противоречить поведению, заданному базовым классом, то есть поведение
    наследуемых классов должно быть ожидаемым для кода который использует базовый класс.
    <br>
    3 .Наследующий класс должен дополнять, а не замещать поведение базового класса. и не должно противоречить поведению,
    заданному базовым классом
</p>
<p>Источники&raquo;
    <a class="btn btn-secondary" target="_blank" href="https://habr.com/ru/post/208442/" role="button">
        Habr
    </a>
    <a class="btn btn-secondary" target="_blank"
       href="http://simple-training.com/solid-in-php/solid-3-liskovs-substitution-principle/" role="button">
        simple-training
    </a>
    Рассмотрим пример:
</p>
<pre>
    <code class="php">
<?= $content; ?>
    </code>
</pre>
