
            <h2>Принцип открытости/закрытости (Open-closed)</h2>
            <p> программные сущности должны быть открыты для расширения, но закрыты для модификации
                Такой подход нарушает принцип открытости-закрытости. Как видно, здесь, если нам надо дать некоей группе
                клиентов
                особую скидку, приходится добавлять в класс новый код.
            </p>
            <p>
                <a class="btn btn-secondary" href="https://medium.com/webbdev/solid-4ffc018077da" role="button">Site&raquo;</a>
            </p>

            <pre>
                <code class="php">
                    <?= /** @var string $content */ $content; ?>
                </code>
            </pre>
