<h2>Принцип подстановки Барбары Лисков (Liskov substitution)</h2>
<p>Объекты в программе могут быть заменены их наследниками без изменения свойств программы». Своими словами я бы это
    сказал так — при использовании наследника класса результат выполнения кода должен быть предсказуем и не изменять
    свойств метод.
</p>
<p>Источники&raquo;
    <a class="btn btn-secondary" target="_blank" href="https://habr.com/ru/post/208442/" role="button">
        Habr
    </a>
    Рассмотрим пример:
</p>
<pre>
    <code class="php">
<?= $content; ?>
    </code>
</pre>
