<h2>Принцип единственной ответственности (Single responsibility)</h2>
<p> Принцип единственной ответственности гласит — «На каждый объект должна быть возложена одна единственная
    обязанность». Т.е. другими словами — конкретный класс должен решать конкретную задачу — ни больше, ни меньше.
</p>
<p>
    Рассмотрим описание класса для представления заказа в интернет-магазине:
    <a class="btn btn-secondary" target="_blank" href="https://habr.com/ru/post/208442/" role="button">
        Habr&raquo;
    </a>
</p>
<pre>
    <code class="php">
<?= $content; ?>
    </code>
</pre>