<h2>
    Фабричный метод
    <a class="btn btn-secondary" target="_blank" href="https://tproger.ru/translations/design-patterns-simple-words-1/#12">
        tproger
    </a>
</h2>

<p>
    Это порождающий паттерн проектирования, который определяет общий интерфейс для создания объектов в суперклассе,
    позволяя подклассам изменять тип создаваемых объектов. В момент создания наследники могут определить, какой класс
    создавать. Иными словами, данный шаблон делегирует создание объектов наследникам родительского класса. Это позволяет
    использовать в коде программы не специфические классы, а манипулировать абстрактными объектами на более высоком
    уровне.
</p>

<p>
    <b>Пример из жизни</b>: Рассмотрим пример с менеджером по найму. Невозможно одному человеку провести собеседования
    со всеми кандидатами на все вакансии. В зависимости от вакансии он должен распределить этапы собеседования между
    разными людьми.<br>
    <b>Простыми словами</b>: данный шаблон делегирует создание объектов наследникам родительского класса
</p>
<pre>
    <code class="php">
        <?= $content ?>
    </code>
</pre>
<p>
    <b>Когда использовать</b>: Полезен, когда есть некоторая общая обработка в классе, но необходимый подкласс
    динамически
    определяется во время выполнения. Иными словами, когда клиент не знает, какой именно подкласс ему может
    понадобиться.
</p>