<h2>Краткий обзор движков таблиц MySQL</h2>
<p>Источники&raquo;
    <a class="btn btn-secondary" target="_blank" href="https://itif.ru/otlichiya-myisam-innodb/" role="button">
        itif.ru
    </a>
</p>

<table class="table table-bordered table-hover">
    <thead>
    <tr>
        <th scope="col">Описание</th>
        <th scope="col"><b>MyISAM</b></th>
        <th scope="col"><b>InnoDB</b></th>
    </tr>
    </thead>
    <tbody>
    <tr>
        <td><b>Транзакционный движек?</b> Транзакция (Transaction) — блок операторов SQL , который в случае ошибки в
            одном
            запросе, возвращается к предыдущему состоянию (Rollback), и только в случае выполнения всех запросов
            подтверждается (Commit)
        </td>
        <td>нет</td>
        <td>да</td>
    </tr>
    <tr>
        <td><b>Поддержка внешних ключей</b>Внешние ключи — это способ связать записи в двух таблицах по определенным
            полям так, что при обновлении поля в родительской автоматически происходит определенное изменение поля в
            дочерней (дочернюю и родительскую выбираешь при создании ключа; точнее, создаешь ключ в дочерней, который
            ссылается на родительскую).
        </td>
        <td>нет</td>
        <td>да</td>
    </tr>
    <tr>
        <td><b>Блокировка</b> Блокировка на уровне строк, т.е. если процессу нужно обновить строку в таблице, то он
            блокирует только эту строку, позволяя другим обновлять другие строки параллельно
        </td>
        <td>Блокировка на уровне таблиц</td>
        <td>Блокировка на уровне строк</td>
    </tr>
    <tr>
        <td>Одновременные запросы к разным частям таблицы.
        </td>
        <td>Медленнее</td>
        <td>Быстрее</td>
    </tr>
    <tr>
        <td>При смешанной нагрузке в таблице (select/update/delete/insert)
        </td>
        <td>Медленнее</td>
        <td>Быстрее</td>
    </tr>
    <tr>
        <td>Операция Insert
        </td>
        <td>Быстрее</td>
        <td>Медленнее, ибо есть оверхед на транзакцию, но это цена надежности</td>
    </tr>
    <tr>
        <td>Если преобладают операции чтения (SELECT)
        </td>
        <td>Работает быстрее</td>
        <td>Работает медленнее</td>
    </tr>
    <tr>
        <td>Поддержка полнотекстового поиска
        </td>
        <td>Да</td>
        <td>Нет (доступен начиная с версии MySQL 5.6.4)
        </td>
    </tr>
    <tr>
        <td>Запрос Count(*)
        </td>
        <td>Быстрее</td>
        <td>Медленнее</td>
    </tr>
    <tr>
        <td><b>Поддержка mysqlhotcopy</b> Утилита mysqlhotcopy представляет собой Perl-сценарий, использующий
            SQL-команды LOCK
            TABLES, FLUSH TABLES и Unix-утилиты cp или scp для быстрого получения резервной копии базы данных.
        </td>
        <td>Да</td>
        <td>Нет</td>
    </tr>
    <tr>
        <td>Файловое хранение таблиц
        </td>
        <td>Каждой таблице отдельный файл</td>
        <td>Данные при настройках по умолчанию хранятся в больших совместно используемых файлах</td>
    </tr>
    <tr>
        <td><b>Бинарное копировании таблиц?</b> Табличные файлы можно перемещать между компьютерами
            разных архитектур и разными операционными системами без всякого преобразования
        </td>
        <td>Да</td>
        <td>Нет</td>
    </tr>
    <tr>
        <td>Размер таблиц в БД</td>
        <td>Меньше</td>
        <td>Больше</td>
    </tr>
    <tr>
        <td>Поведение в случае сбоя</td>
        <td>Крашится вся таблица</td>
        <td>По логам можно все восстановить</td>
    </tr>
    <tr>
        <td>В случае хранения «логов» и подобного</td>
        <td>Лучше</td>
        <td>Хуже</td>
    </tr>
    </tbody>
</table>
<p><b>Выводы:</b>
<ul>
    <li>
        <b>MyISAM</b> стоит использовать, если нужен полнотекстовый поиск до версии 5.6. Также этот движок подойдет,
        когда в
        таблице очень мало записей и большое количество чтений или преобладает один вид доступа: чтение (новостной сайт)
        или
        запись (например, логирование);
    </li>
    <li>Использование InnoDB имеет смысл во всех остальных случаях и случаях повышенных требований по сохранности
        данных.
    </li>
</ul>
</p>